EXAMP2: PROC OPTIONS (MAIN);                                                    DCL W BIN FIXED (31) INIT ( 11B );                                              DCL O BIN FIXED (31) INIT ( 100B );                                             DCL H BIN FIXED (31) INIT ( 101B );                                             DCL I BIN FIXED (31) INIT ( 100B );                                             DCL L BIN FIXED (31) INIT ( 100B );                                             DCL N BIN FIXED (31) INIT ( 100B );                                             DCL S BIN FIXED (31);                                                           N,S = 0;                                                                        S = W + O - H + I + L + N;                                                      END EXAMP2;                                                                     