EXAMP: PROC OPTIONS (MAIN);                                                     DCL L BIN FIXED (31) INIT ( 11B );                                              DCL N BIN FIXED (31) INIT ( 100B );                                             DCL S BIN FIXED (31) INIT ( 101B );                                             DCL I BIN FIXED (31);                                                           I = L + N - S;                                                                  END EXAMP;                                                                      