EX23: PROC OPTIONS ( MAIN );                                                    DCL N BIN FIXED ( 15 );                                                         DCL S BIN FIXED ( 15 );                                                         N,S = 0;                                                                        DO WHILE (N<5);                                                                 NOC;                                                                            END EX23;                                                                       