EX23: PROC OPTIONS ( MAIN );                                                    DCL N BIN FIXED ( 15 );                                                         DCL S BIN FIXED ( 15 );                                                         N,S = 0;                                                                        DO WHILE (N<5);                                                                 S = S + N;                                                                      END;                                                                            END EX23;                                                                       